_Rarzrabotki/Rarus/USO2/DataProcessors/СМ_СравнениеСмет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>СМ_СравнениеСмет</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Смета1</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_ОбъектнаяСмета</v8:Type>
						<v8:Type>cfg:DocumentRef.СМ_СводнаяСмета</v8:Type>
						<v8:Type>cfg:DocumentRef.СМ_ЛокальнаяСмета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Смета2</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_ОбъектнаяСмета</v8:Type>
						<v8:Type>cfg:DocumentRef.СМ_СводнаяСмета</v8:Type>
						<v8:Type>cfg:DocumentRef.СМ_ЛокальнаяСмета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фоном</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Акт</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_АктВыполненныхРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДопЗМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗатратыТрудаМашин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗатратыТрудаРабочих</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимВозвратМатер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимЗарплМашин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимОборуд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимОснЗарплата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимПрямЗатраты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимСтоимМатер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимЭксплМашин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимОборудЗаказчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимПоПрайсам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Смета</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_АктВыполненныхРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.СМ_ЛокальнаяСмета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_РазделЛокальнойСметы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Позиция</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_ПозицияЛокальнойСметы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ТипыСтроительства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ТипыСтроительства</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НовоеСтроительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КапитальныйРемонт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДорожноеСтроительство</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ВидыЗатратСмета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ВидыЗатратСмета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МонтажныеРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщестроительныеРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МеталломонтажныеРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СантехническиеРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БуровзрывныеРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГорнопроходческиеРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МебельИнвентарь</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/DataProcessors/СМ_СравнениеСмет/Forms/Форма/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ФормаДлительнойОперации;

&НаКлиенте
Перем ПараметрыОбработчика;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если СтрНайти(ЭтотОбъект.ИмяФормы,"ВнешняяОбработка") = 0 Тогда
		Объект.Фоном = Истина;
	КонецЕсли;
	
	НовСтрока 					= ПоляПозиции.Добавить();
	НовСтрока.Поле 				= "Шифр позиции";
	НовСтрока.ИмяРеквизита 		= "ОбоснСметнойСтоим1";
	НовСтрока.ИмяРеквизитаДоп 	= "ОбоснСметнойСтоим";
	
	НовСтрока 					= ПоляПозиции.Добавить();
	НовСтрока.Поле 				= Метаданные.Документы.СМ_ПозицияЛокальнойСметы.Реквизиты.ТипНормативныхСборников.Синоним;
	НовСтрока.ИмяРеквизита 		= "ТНС1";
	НовСтрока.ИмяРеквизитаДоп 	= "ТНС";
	
	НовСтрока 					= ПоляПозиции.Добавить();
	НовСтрока.Поле 				= "Наименование";
	НовСтрока.ИмяРеквизита 		= "Наименование1";
	НовСтрока.ИмяРеквизитаДоп 	= "Наименование";
	
	НовСтрока 					= ПоляПозиции.Добавить();
	НовСтрока.Поле 				= "№ п/п";
	НовСтрока.ИмяРеквизита 		= "НомерПП1";
	НовСтрока.ИмяРеквизитаДоп 	= "НомерПП";
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.СМ_АктВыполненныхРабот") Тогда
		Объект.Акт = ВыбранноеЗначение;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СравнениеПоАктуПриИзменении(Элемент)
	
	Если СравнениеПоАкту Тогда
		Элементы.Смета2.Видимость 	= Ложь;
		Элементы.Акт.Видимость		= Истина;
		ЗаполнитьАктПоСмете();
	Иначе
		Элементы.Смета2.Видимость 	= Истина;
		Элементы.Акт.Видимость		= Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Смета1ПриИзменении(Элемент)
	
	Если СравнениеПоАкту Тогда
		ЗаполнитьАктПоСмете();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АктНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Объект.Смета1) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Выберите смету!'"));
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЛокальнаяСмета",Объект.Смета1);
	ОткрытьФорму("Документ.СМ_АктВыполненныхРабот.ФормаВыбора",СтруктураПараметров,ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура АктНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Объект.Смета1) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Выберите смету!'"));
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЛокальнаяСмета",Объект.Смета1);
	ОткрытьФорму("Документ.СМ_АктВыполненныхРабот.ФормаВыбора",СтруктураПараметров,ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сравнить(Команда)
	
	Успешно = Ложь;
	Для Каждого стр Из ПоляПозиции Цикл
		Если стр.Поиск Тогда
			Успешно = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не Успешно Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не выбраны поля поиска расценок.'"));
		Возврат;
	КонецЕсли;
	
	Если СравнениеПоАкту Тогда
		Если НЕ ЗначениеЗаполнено(Объект.Смета1) ИЛИ НЕ ЗначениеЗаполнено(Объект.Акт) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не выбрана смета / акт для сравнения.'"));
			Возврат;
		КонецЕсли;
	Иначе	
		Если НЕ ЗначениеЗаполнено(Объект.Смета1) ИЛИ НЕ ЗначениеЗаполнено(Объект.Смета2) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не выбраны сметы для сравнения.'"));
			Возврат;
		КонецЕсли;
		
		Если ТипЗнч(Объект.Смета1) <> ТипЗнч(Объект.Смета2) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Для сравнения доступны только одинаковые виды смет.'"));
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ФоновоеЗадание = Ложь;
	СравнитьНаСервере(ФоновоеЗадание);
	Если ФоновоеЗадание Тогда
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
		ПодключитьОбработчикОжидания("ФоновоеЗаданиеНаКлиенте", 1, Истина);
		ПараметрыОбработчика.МаксимальныйИнтервал = 5;
		ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтотОбъект, ФоновоеЗаданиеИдентификатор);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОчисткаШаблонСДанными()
	ШаблонСДанными.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ФоновоеЗаданиеНаКлиенте()
	Результат = ФоновоеЗаданиеЗагрузкаФайлаПолучитьРезультат();
	Если Результат.ФоновоеЗаданиеВыполнено Тогда
		Если ФормаДлительнойОперации.Открыта() 
			И ФормаДлительнойОперации.ИдентификаторЗадания = ФоновоеЗаданиеИдентификатор Тогда
				ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		КонецЕсли;
		СтруктураХранилище = ПолучитьИзВременногоХранилища(ФоновоеЗаданиеАдресХранилища);
		ШаблонСДанными = СтруктураХранилище.ШаблонСДанными;
	Иначе
		ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
		ПодключитьОбработчикОжидания("ФоновоеЗаданиеНаКлиенте", ПараметрыОбработчика.ТекущийИнтервал, Истина);
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ФоновоеЗаданиеЗагрузкаФайлаПолучитьРезультат()
	Результат = Новый Структура;
	Результат.Вставить("ФоновоеЗаданиеВыполнено", Ложь);
	Результат.ФоновоеЗаданиеВыполнено = ДлительныеОперации.ЗаданиеВыполнено(ФоновоеЗаданиеИдентификатор);
	Возврат Результат;
КонецФункции

&НаСервере
Процедура СравнитьНаСервере(ФоновоеЗадание = Ложь)
	
	ОчисткаШаблонСДанными();

	ПараметрыВызоваСервера = Новый Структура();
	ПараметрыВызоваСервера.Вставить("ПоляПозиции", ПоляПозиции.Выгрузить());
	ПараметрыВызоваСервера.Вставить("ШаблонСДанными", ШаблонСДанными);
	ПараметрыВызоваСервера.Вставить("СравнениеПоАкту",СравнениеПоАкту);
	
	Если СравнениеПоАкту Тогда
		ПараметрыВызоваСервера.Вставить("СметыСравнения", Новый Структура("Смета1,Смета2",Объект.Смета1,Объект.Акт));	
	Иначе
		ПараметрыВызоваСервера.Вставить("СметыСравнения", Новый Структура("Смета1,Смета2",Объект.Смета1,Объект.Смета2));
		Если Объект.Смета1.ТипСтроительства <> Объект.Смета2.ТипСтроительства Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Для сравнения не доступны сметы с разным типом строительства.'"));
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если Не Объект.Фоном Тогда
		СравнитьСметы(ПараметрыВызоваСервера);  
	Иначе
		// Сравнение в фоновом режиме
		РезультатФоновогоЗадания = ДлительныеОперации.ЗапуститьВыполнениеВФоне(УникальныйИдентификатор, 
		"Обработки.СМ_СравнениеСмет.СравнитьСметы",ПараметрыВызоваСервера, НСтр("ru = 'Обработка Сравнение смет: Выполнение серверного метода сравнения смет'"));
		
		Если РезультатФоновогоЗадания.ЗаданиеВыполнено Тогда
			ФоновоеЗаданиеАдресХранилища 	= РезультатФоновогоЗадания.АдресХранилища;
			СтруктураХранилище 				= ПолучитьИзВременногоХранилища(ФоновоеЗаданиеАдресХранилища);
			ШаблонСДанными 					= СтруктураХранилище.ШаблонСДанными;
		Иначе
			ФоновоеЗадание 					= Истина;
			ФоновоеЗаданиеИдентификатор  	= РезультатФоновогоЗадания.ИдентификаторЗадания;
			ФоновоеЗаданиеАдресХранилища 	= РезультатФоновогоЗадания.АдресХранилища;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СравнитьСметы(ПараметрыВызоваСервера)
	
	// Сравнение сметы с актом
	Если ПараметрыВызоваСервера.СравнениеПоАкту Тогда
		
		ДеревоСмета1 = СоздатьДерево();
		СМ_СметныйСоставВызовСервера.ВывестиОбновитьДерево(ПараметрыВызоваСервера.СметыСравнения.Смета1, ДеревоСмета1);
		ПроставитьУровень(ДеревоСмета1.Строки,0);
		
		ДеревоСмета2		= СоздатьДеревоАкта();
		РеквизитыСравнения 	= ПолучитьСписокДляСравненияАкт();
		ТекАкт 				= ПараметрыВызоваСервера.СметыСравнения.Смета2;
		ТекСмета 			= ТекАкт.ЛокальнаяСмета;
		СМ_СметныйСоставВызовСервера.ВывестиОбновитьДерево(ТекСмета,ДеревоСмета2,ТекАкт,Истина);
		ПроставитьУровень(ДеревоСмета2.Строки,0);
		ПереименуемКолонкиДерева(ДеревоСмета2);
		ТабСтоимости = ПолучитьЕдиничнуюСтоимостьПозиций(ТекСмета,ТекАкт);
		ПересчетДереваПоАктуДанныеРегистра(ДеревоСмета1,ТабСтоимости);
		
	Иначе
			
		// Сравнение объектных смет
		Если ТипЗнч(ПараметрыВызоваСервера.СметыСравнения.Смета2) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") Тогда
		
			ДеревоСмета1 = СобратьДанныеПоСмете(ПараметрыВызоваСервера.СметыСравнения.Смета1);
			ДеревоСмета2 = СобратьДанныеПоСмете(ПараметрыВызоваСервера.СметыСравнения.Смета2);
			
			ОбъектОбработки 	= РеквизитФормыВЗначение("Объект");
			Макет 				= ОбъектОбработки.ПолучитьМакет("МакетСравнениеОС");
			ОбластьЗаголовок 	= Макет.ПолучитьОбласть("Заголовок");
			ОбластьШапка 		= Макет.ПолучитьОбласть("Шапка");

			ШаблонСДанными.Вывести(ОбластьЗаголовок);
			ШаблонСДанными.Вывести(ОбластьШапка);	
			
			ОбщаяТаблицаДанных 	= ПолучитьОбщуюТаблицуДанныхОС(ДеревоСмета1,ДеревоСмета2);
			РеквизитыСравнения 	= ПолучитьСписокРеквизитовСравнения();
			ТипСтроительства	= ПараметрыВызоваСервера.СметыСравнения.Смета1.ТипСтроительства;

			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("ЭтоСмета",Истина);
			
			ТаблицаДанных1 	= ДеревоСмета1.Скопировать(СтруктураОтбора); 
			ТаблицаДанных2 	= ДеревоСмета2.Скопировать(СтруктураОтбора);
		
			ПереименуемКолонкиДерева(ТаблицаДанных2);
			ПереименуемКолонкиДерева(ДеревоСмета2);

			ВывестиДанныеПоОС(РеквизитыСравнения,Макет,ДеревоСмета1,ДеревоСмета2,ОбщаяТаблицаДанных,ТипСтроительства);
			
		// Сравнение сводных смет
		ИначеЕсли ТипЗнч(ПараметрыВызоваСервера.СметыСравнения.Смета2) = Тип("ДокументСсылка.СМ_СводнаяСмета") Тогда
			
			ДеревоСмета1 = СобратьДанныеПоСмете(ПараметрыВызоваСервера.СметыСравнения.Смета1);
			ДеревоСмета2 = СобратьДанныеПоСмете(ПараметрыВызоваСервера.СметыСравнения.Смета2);
			
			ОбъектОбработки 	= РеквизитФормыВЗначение("Объект");
			Макет 				= ОбъектОбработки.ПолучитьМакет("МакетСравнениеСС");
			ОбластьЗаголовок 	= Макет.ПолучитьОбласть("Заголовок");
			ОбластьШапка 		= Макет.ПолучитьОбласть("Шапка");
			
			ШаблонСДанными.Вывести(ОбластьЗаголовок);
			ШаблонСДанными.Вывести(ОбластьШапка);
			
			СтруктураДанных		= ПолучитьОбщуюТаблицуДанныхСС(ДеревоСмета1,ДеревоСмета2);
			РеквизитыСравнения 	= ПолучитьСписокРеквизитовСравнения();
		
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("ЭтоСмета",Истина);
			
			ТаблицаДанных1 = ДеревоСмета1.Скопировать(СтруктураОтбора); 
			ТаблицаДанных2 = ДеревоСмета2.Скопировать(СтруктураОтбора);

			ПереименуемКолонкиДерева(ТаблицаДанных2);
			ПереименуемКолонкиДерева(ДеревоСмета2);
			
			ОбщаяТаблицаДанных	= СтруктураДанных.ТабИтогов;
			ТабГлавы			= СтруктураДанных.ТабГлавы;
			ТипСтроительства	= ПараметрыВызоваСервера.СметыСравнения.Смета1.ТипСтроительства;
			
			ВывестиДанныеПоСС(РеквизитыСравнения,Макет,ДеревоСмета1,ДеревоСмета2,ОбщаяТаблицаДанных,ТабГлавы,ТипСтроительства);
			
		// Сравнение локальных смет
		ИначеЕсли ТипЗнч(ПараметрыВызоваСервера.СметыСравнения.Смета2) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") Тогда
			
			ДеревоСмета1 = СоздатьДерево();
			СМ_СметныйСоставВызовСервера.ВывестиОбновитьДерево(ПараметрыВызоваСервера.СметыСравнения.Смета1, ДеревоСмета1);
			ПроставитьУровень(ДеревоСмета1.Строки,0);			
					
			ДеревоСмета2 		= ДеревоСмета1.Скопировать();
			РеквизитыСравнения 	= ПолучитьСписокДляСравнения();
			СМ_СметныйСоставВызовСервера.ВывестиОбновитьДерево(ПараметрыВызоваСервера.СметыСравнения.Смета2, ДеревоСмета2);
			ПроставитьУровень(ДеревоСмета2.Строки,0);
			ПереименуемКолонкиДерева(ДеревоСмета2);
			
			ОбъектОбработки = РеквизитФормыВЗначение("Объект");
			Макет = ОбъектОбработки.ПолучитьМакет("Макет");
			
			ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
			ШаблонСДанными.Вывести(ОбластьЗаголовок);
			
			ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
			ШаблонСДанными.Вывести(ОбластьШапка);	
			
			ОбластьРаздел 	= Макет.ПолучитьОбласть("ОбластьРаздел");
			ОбластьПозиция 	= Макет.ПолучитьОбласть("ОбластьПозиция");
			
			Корень = ДеревоСмета1.Строки[0];
			ОбластьРаздел.Параметры.Заполнить(Корень);
			Корень.Обработано = Истина;
			
			Корень1 = ДеревоСмета2.Строки[0];
			ОбластьРаздел.Параметры.Заполнить(Корень1);
			Корень1.Обработано1 = Истина;        
			
			ТекстОтбора = СформироватьОтборРасценок(ПараметрыВызоваСервера.ПоляПозиции);
			
			ШаблонСДанными.НачатьАвтогруппировкуСтрок();
			ШаблонСДанными.Вывести(ОбластьРаздел,0);
			
			ВывестиУровень(РеквизитыСравнения,Макет,Корень.Строки,Корень1.Строки,Корень1,ТекстОтбора,1);
			
			МассивСтрок = Корень1.Строки.НайтиСтроки(Новый Структура("Обработано1",Ложь),Истина);
			ВывестиНеОбработанные(Макет,МассивСтрок,1);
			
			ШаблонСДанными.ЗакончитьАвтогруппировкуСтрок();
			
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

// Единичная стоимость берется из дерева сметного состава и умножается на объем позиций по акту.
// Итоги суммируются по разделам / смете.
&НаСервере
Процедура ПересчетДереваПоАктуДанныеСметногоСостава(ДеревоСметы,ДеревоАкта)
	
	// Пересчет дерева по позициям акта
	Для Каждого ТекСтрока Из ДеревоСметы.Строки Цикл
		Если ТипЗнч(ТекСтрока.Элемент) = Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы") Тогда
			НайденнаяСтрока = ДеревоАкта.Строки.Найти(ТекСтрока.Элемент,"Элемент1",Истина);
			Если НайденнаяСтрока <> Неопределено Тогда
				// Здесь нужно рассчитать стоимость по акту
				ПроцентПоАкту 						= НайденнаяСтрока.ОбъемПоАктуПроцент1 / 100;
				ОбъемПоАкту							= НайденнаяСтрока.ОбъемПоАкту1;
				ТекСтрока.Кол						= ОбъемПоАкту;
				ТекСтрока.ОбщВсего 				  	= ТекСтрока.ЕдВсего * ОбъемПоАкту;
				ТекСтрока.ОбщОснЗП                	= ТекСтрока.ЕдОснЗП * ОбъемПоАкту;
				ТекСтрока.ОбщЭксплМашин           	= ТекСтрока.ЕдЭксплМашин * ОбъемПоАкту;
				ТекСтрока.ОбщЭМЗарПлата           	= ТекСтрока.ЕдЭМЗарПлата * ОбъемПоАкту;
				ТекСтрока.ОбщСтоимостьМатериалов	= ТекСтрока.ЕдСтоимостьМатериалов * ОбъемПоАкту;
				ТекСтрока.ОбщЗатрТрРаб            	= ТекСтрока.ЕдЗатрТрРаб * ОбъемПоАкту;
				ТекСтрока.ОбщЗатрТрМех            	= ТекСтрока.ЕдЗатрТрМех * ОбъемПоАкту;
				ПересчитатьИтогиВладельца(ТекСтрока.Родитель,ТекСтрока);
			Иначе
				// можно удалить эту строку
				// пока просто пропускаем
			КонецЕсли;
		Иначе
			// Обнуление итогов владельца
			ТекСтрока.ОбщВсего 					= 0;
			ТекСтрока.ОбщОснЗП                	= 0;
			ТекСтрока.ОбщЭксплМашин           	= 0;
			ТекСтрока.ОбщЭМЗарПлата           	= 0;
			ТекСтрока.ОбщСтоимостьМатериалов  	= 0;
			ТекСтрока.ОбщЗатрТрРаб            	= 0;
			ТекСтрока.ОбщЗатрТрМех            	= 0;
		КонецЕсли;
		
		Если ТекСтрока.Строки.Количество() > 0 Тогда
			ПересчетДереваПоАктуДанныеСметногоСостава(ТекСтрока,ДеревоАкта);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Единичная стоимость берется по регистру "СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета".
// Единичные стоимости по позициям сразу соединяется с объемом по акту.
// Итоги перасчитываются суммированием по разделам / смете.
&НаСервере
Процедура ПересчетДереваПоАктуДанныеРегистра(ДеревоСметы,ТабСтоимости)
	
	// Пересчет дерева по позициям акта
	Для Каждого ТекСтрока Из ДеревоСметы.Строки Цикл
		Если ТипЗнч(ТекСтрока.Элемент) = Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы") Тогда
			НайденнаяСтрока = ТабСтоимости.Найти(ТекСтрока.Элемент,"Позиция");
			Если НайденнаяСтрока <> Неопределено Тогда
				// Здесь нужно рассчитать стоимость по акту
				ОбъемПоАкту							= НайденнаяСтрока.ФактОбъем;
				ТекСтрока.Кол						= ОбъемПоАкту;
				ТекСтрока.ОбщВсего 				  	= НайденнаяСтрока.СтоимПрямЗатраты * ОбъемПоАкту;
				ТекСтрока.ОбщОснЗП                	= НайденнаяСтрока.СтоимОснЗарплата * ОбъемПоАкту;
				ТекСтрока.ОбщЭксплМашин           	= НайденнаяСтрока.СтоимЭксплМашин * ОбъемПоАкту;
				ТекСтрока.ОбщЭМЗарПлата           	= НайденнаяСтрока.СтоимЗарплМашин * ОбъемПоАкту;
				ТекСтрока.ОбщСтоимостьМатериалов	= НайденнаяСтрока.СтоимСтоимМатер * ОбъемПоАкту;
				ТекСтрока.ОбщЗатрТрРаб            	= НайденнаяСтрока.ЗатратыТрудаРабочих * ОбъемПоАкту;
				ТекСтрока.ОбщЗатрТрМех            	= НайденнаяСтрока.ЗатратыТрудаМашин * ОбъемПоАкту;
				ПересчитатьИтогиВладельца(ТекСтрока.Родитель,ТекСтрока);
			Иначе
				// можно удалить эту строку
				// пока просто пропускаем
			КонецЕсли;
		Иначе
			// Обнуление итогов владельца
			ТекСтрока.ОбщВсего 					= 0;
			ТекСтрока.ОбщОснЗП                	= 0;
			ТекСтрока.ОбщЭксплМашин           	= 0;
			ТекСтрока.ОбщЭМЗарПлата           	= 0;
			ТекСтрока.ОбщСтоимостьМатериалов  	= 0;
			ТекСтрока.ОбщЗатрТрРаб            	= 0;
			ТекСтрока.ОбщЗатрТрМех            	= 0;
		КонецЕсли;
		
		Если ТекСтрока.Строки.Количество() > 0 Тогда
			ПересчетДереваПоАктуДанныеРегистра(ТекСтрока,ТабСтоимости);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьИтогиВладельца(ТекРодитель,ТекСтрока)
	
	ТекРодитель.ОбщВсего 				= ТекРодитель.ОбщВсего + ТекСтрока.ОбщВсего;
	ТекРодитель.ОбщОснЗП                = ТекРодитель.ОбщОснЗП + ТекСтрока.ОбщОснЗП;
	ТекРодитель.ОбщЭксплМашин           = ТекРодитель.ОбщЭксплМашин + ТекСтрока.ОбщЭксплМашин;
	ТекРодитель.ОбщЭМЗарПлата           = ТекРодитель.ОбщЭМЗарПлата + ТекСтрока.ОбщЭМЗарПлата;
	ТекРодитель.ОбщСтоимостьМатериалов  = ТекРодитель.ОбщСтоимостьМатериалов + ТекСтрока.ОбщСтоимостьМатериалов;
	ТекРодитель.ОбщЗатрТрРаб            = ТекРодитель.ОбщЗатрТрРаб + ТекСтрока.ОбщЗатрТрРаб;
	ТекРодитель.ОбщЗатрТрМех            = ТекРодитель.ОбщЗатрТрМех + ТекСтрока.ОбщЗатрТрМех;
	
	Если ТекРодитель.Родитель <> Неопределено Тогда
		ПересчитатьИтогиВладельца(ТекРодитель.Родитель,ТекСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СоздатьДерево()
	
	ДеревоСмета1 = Новый ДеревоЗначений;
	ДеревоСмета1.Колонки.Добавить("Элемент");
	ДеревоСмета1.Колонки.Добавить("НомерПП");
	ДеревоСмета1.Колонки.Добавить("Расчет");
	ДеревоСмета1.Колонки.Добавить("ОбоснСметнойСтоим");
	ДеревоСмета1.Колонки.Добавить("НаимРаботИЗатрат");
	ДеревоСмета1.Колонки.Добавить("Кол");
	ДеревоСмета1.Колонки.Добавить("Измеритель");
	ДеревоСмета1.Колонки.Добавить("СтоимостьЕдиницы");
	ДеревоСмета1.Колонки.Добавить("ЕдВсего");
	ДеревоСмета1.Колонки.Добавить("ЕдОснЗП");
	ДеревоСмета1.Колонки.Добавить("ЕдЭксплМашин");
	ДеревоСмета1.Колонки.Добавить("ЕдЭМЗарПлата");
	ДеревоСмета1.Колонки.Добавить("ЕдСтоимостьМатериалов");
	ДеревоСмета1.Колонки.Добавить("ОбщаяСтоимость");
	ДеревоСмета1.Колонки.Добавить("ОбщВсего");
	ДеревоСмета1.Колонки.Добавить("ОбщОснЗП");
	ДеревоСмета1.Колонки.Добавить("ОбщЭксплМашин");
	ДеревоСмета1.Колонки.Добавить("ОбщЭМЗарПлата");
	ДеревоСмета1.Колонки.Добавить("ОбщСтоимостьМатериалов");
	ДеревоСмета1.Колонки.Добавить("ЕдЗатрТрРаб");
	ДеревоСмета1.Колонки.Добавить("ЕдЗатрТрМех");
	ДеревоСмета1.Колонки.Добавить("ОбщЗатрТрРаб");
	ДеревоСмета1.Колонки.Добавить("ОбщЗатрТрМех");
	ДеревоСмета1.Колонки.Добавить("ИДРодителя");
	ДеревоСмета1.Колонки.Добавить("Наименование");
	ДеревоСмета1.Колонки.Добавить("РодительРасценки");
	ДеревоСмета1.Колонки.Добавить("Версия");
	ДеревоСмета1.Колонки.Добавить("ОбъемВсего");
	ДеревоСмета1.Колонки.Добавить("ТипСтроки");
	ДеревоСмета1.Колонки.Добавить("ИндексПересчет");
	ДеревоСмета1.Колонки.Добавить("ИндексПривязана");
	ДеревоСмета1.Колонки.Добавить("ИндексНеИндексировать");
	ДеревоСмета1.Колонки.Добавить("ИндексПоправки");
	ДеревоСмета1.Колонки.Добавить("Картинка");
	ДеревоСмета1.Колонки.Добавить("ПорНомер");
	ДеревоСмета1.Колонки.Добавить("НомерВДереве");
	ДеревоСмета1.Колонки.Добавить("НомерВПределахСметы");
	ДеревоСмета1.Колонки.Добавить("ИДПозицииВладельца");
	ДеревоСмета1.Колонки.Добавить("Уровень");
	ДеревоСмета1.Колонки.Добавить("ТНС");
	ДеревоСмета1.Колонки.Добавить("Обработано",Новый ОписаниеТипов("Булево"));
	ДеревоСмета1.Колонки.Добавить("ПроверкаЗаполненияРеквизитов",Новый ОписаниеТипов("Булево"));

	Возврат ДеревоСмета1;
	
КонецФункции

&НаСервере
Функция СоздатьДеревоАкта()
	
	ДопустимыеТипы = Новый ОписаниеТипов("Число");
	
	ДеревоСмета1 = Новый ДеревоЗначений;
	ДеревоСмета1.Колонки.Добавить("Элемент");
	ДеревоСмета1.Колонки.Добавить("НомерПП");
	ДеревоСмета1.Колонки.Добавить("Расчет");
	ДеревоСмета1.Колонки.Добавить("ОбоснСметнойСтоим");
	ДеревоСмета1.Колонки.Добавить("НаимРаботИЗатрат");
	ДеревоСмета1.Колонки.Добавить("Кол");
	ДеревоСмета1.Колонки.Добавить("Измеритель");
	ДеревоСмета1.Колонки.Добавить("СтоимостьЕдиницы");
	ДеревоСмета1.Колонки.Добавить("ЕдВсего");
	ДеревоСмета1.Колонки.Добавить("ЕдОснЗП");
	ДеревоСмета1.Колонки.Добавить("ЕдЭксплМашин");
	ДеревоСмета1.Колонки.Добавить("ЕдЭМЗарПлата");
	ДеревоСмета1.Колонки.Добавить("ЕдСтоимостьМатериалов");
	ДеревоСмета1.Колонки.Добавить("ОбщаяСтоимость");
	ДеревоСмета1.Колонки.Добавить("ОбщВсего");
	ДеревоСмета1.Колонки.Добавить("ОбщОснЗП");
	ДеревоСмета1.Колонки.Добавить("ОбщЭксплМашин");
	ДеревоСмета1.Колонки.Добавить("ОбщЭМЗарПлата");
	ДеревоСмета1.Колонки.Добавить("ОбщСтоимостьМатериалов");
	ДеревоСмета1.Колонки.Добавить("ЕдЗатрТрРаб");
	ДеревоСмета1.Колонки.Добавить("ЕдЗатрТрМех");
	ДеревоСмета1.Колонки.Добавить("ОбщЗатрТрРаб");
	ДеревоСмета1.Колонки.Добавить("ОбщЗатрТрМех");
	ДеревоСмета1.Колонки.Добавить("Наименование");
	ДеревоСмета1.Колонки.Добавить("Версия");
	ДеревоСмета1.Колонки.Добавить("ОбъемВсего",ДопустимыеТипы);
	ДеревоСмета1.Колонки.Добавить("ТипСтроки");
	ДеревоСмета1.Колонки.Добавить("ИндексПересчет");
	ДеревоСмета1.Колонки.Добавить("ИндексПривязана");
	ДеревоСмета1.Колонки.Добавить("ИндексНеИндексировать");
	ДеревоСмета1.Колонки.Добавить("ИндексПоправки");
	ДеревоСмета1.Колонки.Добавить("Картинка");
	ДеревоСмета1.Колонки.Добавить("Уровень");
	ДеревоСмета1.Колонки.Добавить("ТНС");
	ДеревоСмета1.Колонки.Добавить("Обработано",Новый ОписаниеТипов("Булево"));
	ДеревоСмета1.Колонки.Добавить("ЕстьФайл");
	ДеревоСмета1.Колонки.Добавить("Звездочка");
	ДеревоСмета1.Колонки.Добавить("ОбъемВсегоПроцент");
	ДеревоСмета1.Колонки.Добавить("ОбъемПоАкту",ДопустимыеТипы);
	ДеревоСмета1.Колонки.Добавить("ОбъемПоАктуПроцент");
	ДеревоСмета1.Колонки.Добавить("ОтмеченаВДереве");
	ДеревоСмета1.Колонки.Добавить("Плюсик");
	ДеревоСмета1.Колонки.Добавить("Пустышка");
	ДеревоСмета1.Колонки.Добавить("СтатусРедактирования");
	ДеревоСмета1.Колонки.Добавить("СтатусРесурса");
	ДеревоСмета1.Колонки.Добавить("УдалитьСтатусРесурсаАкт");

	Возврат ДеревоСмета1;
	
КонецФункции

&НаСервере
Функция ПолучитьЕдиничнуюСтоимостьПозиций(ТекСмета,ТекАкт)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СМ_АктВыполненныхРаботПозиции.Ссылка,
	|	СМ_АктВыполненныхРаботПозиции.ФактОбъем,
	|	СМ_АктВыполненныхРаботПозиции.Позиция,
	|	СМ_АктВыполненныхРаботПозиции.Ссылка.ЛокальнаяСмета
	|ПОМЕСТИТЬ ПозицииАкта
	|ИЗ
	|	Документ.СМ_АктВыполненныхРабот.Позиции КАК СМ_АктВыполненныхРаботПозиции
	|ГДЕ
	|	СМ_АктВыполненныхРаботПозиции.Ссылка.ЛокальнаяСмета = &Смета И
	|	СМ_АктВыполненныхРаботПозиции.Ссылка = &Акт
	|;
	|	
	|ВЫБРАТЬ
	|	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Смета,
	|	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Раздел,
	|	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Позиция,
	|	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.ДопЗМ,
	|	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.ЗатратыТрудаМашин,
	|	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.ЗатратыТрудаРабочих,
	|	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимВозвратМатер,
	|	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимЗарплМашин,
	|	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимОборуд,
	|	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимОснЗарплата,
	|	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимПрямЗатраты,
	|	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимСтоимМатер,
	|	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимЭксплМашин,
	|   ПозицииАкта.ФактОбъем
	|ИЗ
	|	РегистрСведений.СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета КАК СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПозицииАкта КАК ПозицииАкта 
	|	ПО СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Позиция = ПозицииАкта.Позиция
	|ГДЕ
	|	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Смета = &Смета
	|УПОРЯДОЧИТЬ ПО
	| 	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Позиция";
	
	Запрос.УстановитьПараметр("Смета",ТекСмета);
	Запрос.УстановитьПараметр("Акт",ТекАкт);
	
	ТабРезультат = Запрос.Выполнить().Выгрузить();
	
	Возврат ТабРезультат;
		
КонецФункции

&НаСервере
Функция ПолучитьСписокДляСравнения()
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить("Расчет","Расчет1");
	Соответствие.Вставить("ОбоснСметнойСтоим","ОбоснСметнойСтоим1");
	Соответствие.Вставить("НаимРаботИЗатрат","НаимРаботИЗатрат1");
	Соответствие.Вставить("Кол","Кол1");
	Соответствие.Вставить("Измеритель","Измеритель1");
	Соответствие.Вставить("СтоимостьЕдиницы","СтоимостьЕдиницы1");
	Соответствие.Вставить("ЕдВсего","ЕдВсего1");
	Соответствие.Вставить("ЕдОснЗП","ЕдОснЗП1");
	Соответствие.Вставить("ЕдЭксплМашин","ЕдЭксплМашин1");
	Соответствие.Вставить("ЕдЭМЗарПлата","ЕдЭМЗарПлата1");
	Соответствие.Вставить("ЕдСтоимостьМатериалов","ЕдСтоимостьМатериалов1");
	Соответствие.Вставить("ОбщаяСтоимость","ОбщаяСтоимость1");
	Соответствие.Вставить("ОбщВсего","ОбщВсего1");
	Соответствие.Вставить("ОбщОснЗП","ОбщОснЗП1");
	Соответствие.Вставить("ОбщЭксплМашин","ОбщЭксплМашин1");
	Соответствие.Вставить("ОбщЭМЗарПлата","ОбщЭМЗарПлата1");
	Соответствие.Вставить("ОбщСтоимостьМатериалов","ОбщСтоимостьМатериалов1");
	Соответствие.Вставить("ЕдЗатрТрРаб","ЕдЗатрТрРаб1");
	Соответствие.Вставить("ЕдЗатрТрМех","ЕдЗатрТрМех1");
	Соответствие.Вставить("ОбщЗатрТрРаб","ОбщЗатрТрРаб1");
	Соответствие.Вставить("ОбщЗатрТрМех","ОбщЗатрТрМех1");
	Соответствие.Вставить("Наименование","Наименование1");
	Соответствие.Вставить("Версия","Версия1");
	Соответствие.Вставить("ИндексПересчет","ИндексПересчет1");
	Соответствие.Вставить("ИндексПривязана","ИндексПривязана1");
	Соответствие.Вставить("ИндексНеИндексировать","ИндексНеИндексировать1");
	Соответствие.Вставить("ИндексПоправки","ИндексПоправки1");
	Соответствие.Вставить("ПорНомер","ПорНомер1");
	Соответствие.Вставить("ТНС","ТНС1");
	
	Возврат Соответствие;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокДляСравненияАкт()
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить("Расчет","Расчет1");
	Соответствие.Вставить("ОбоснСметнойСтоим","ОбоснСметнойСтоим1");
	Соответствие.Вставить("НаимРаботИЗатрат","НаимРаботИЗатрат1");
	Соответствие.Вставить("Кол","Кол1");
	Соответствие.Вставить("Измеритель","Измеритель1");
	Соответствие.Вставить("СтоимостьЕдиницы","СтоимостьЕдиницы1");
	Соответствие.Вставить("ЕдВсего","ЕдВсего1");
	Соответствие.Вставить("ЕдОснЗП","ЕдОснЗП1");
	Соответствие.Вставить("ЕдЭксплМашин","ЕдЭксплМашин1");
	Соответствие.Вставить("ЕдЭМЗарПлата","ЕдЭМЗарПлата1");
	Соответствие.Вставить("ЕдСтоимостьМатериалов","ЕдСтоимостьМатериалов1");
	Соответствие.Вставить("ОбщаяСтоимость","ОбщаяСтоимость1");
	Соответствие.Вставить("ОбщВсего","ОбщВсего1");
	Соответствие.Вставить("ОбщОснЗП","ОбщОснЗП1");
	Соответствие.Вставить("ОбщЭксплМашин","ОбщЭксплМашин1");
	Соответствие.Вставить("ОбщЭМЗарПлата","ОбщЭМЗарПлата1");
	Соответствие.Вставить("ОбщСтоимостьМатериалов","ОбщСтоимостьМатериалов1");
	Соответствие.Вставить("ЕдЗатрТрРаб","ЕдЗатрТрРаб1");
	Соответствие.Вставить("ЕдЗатрТрМех","ЕдЗатрТрМех1");
	Соответствие.Вставить("ОбщЗатрТрРаб","ОбщЗатрТрРаб1");
	Соответствие.Вставить("ОбщЗатрТрМех","ОбщЗатрТрМех1");
	Соответствие.Вставить("Наименование","Наименование1");
	Соответствие.Вставить("Версия","Версия1");
	Соответствие.Вставить("ИндексПересчет","ИндексПересчет1");
	Соответствие.Вставить("ИндексПривязана","ИндексПривязана1");
	Соответствие.Вставить("ИндексНеИндексировать","ИндексНеИндексировать1");
	Соответствие.Вставить("ИндексПоправки","ИндексПоправки1");
	Соответствие.Вставить("ТНС","ТНС1");
	
	Возврат Соответствие;
	
КонецФункции

&НаСервере
Процедура ПроставитьУровень(СтрокиДерева,Уровень)
	
	Для Каждого стр Из СтрокиДерева Цикл
		Если стр.ТипСтроки <= 1 Тогда
			стр.Уровень = Уровень;
			ПроставитьУровень(стр.Строки,Уровень+1);
		Иначе
			стр.ТНС = стр.Элемент.ТипНормативныхСборников;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПереименуемКолонкиДерева(Дерево)

	Для Каждого кол Из Дерево.Колонки Цикл
		кол.Имя = кол.Имя+"1";
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СформироватьОтборРасценок(ПоляПоиска)
	ТекстОтбора = "ОрборРасценок = Новый Структура(""";
	
	Для Каждого стр из ПоляПоиска Цикл
		Если Не стр.Поиск Тогда
			Продолжить;
		КонецЕсли;
		ТекстОтбора = ТекстОтбора+стр.ИмяРеквизита+",";
	КонецЦикла;
	ТекстОтбора = Лев(ТекстОтбора,СтрДлина(ТекстОтбора)-1)+""",";
	
	Для Каждого стр из ПоляПоиска Цикл
		Если Не стр.Поиск Тогда
			Продолжить;
		КонецЕсли;
		ТекстОтбора = ТекстОтбора+"стр."+стр.ИмяРеквизитаДоп+",";
	КонецЦикла;
	ТекстОтбора = Лев(ТекстОтбора,СтрДлина(ТекстОтбора)-1)+")";
	
	Возврат ТекстОтбора;
КонецФункции

&НаСервере
Процедура ВывестиУровень(РеквизитыСравнения,Макет,СтрокиДерева,СтрокиДерева2,ПолноеДерево,ТекстОтбора,Уровень,Пусто = Ложь)
	
	Для Каждого стр Из СтрокиДерева Цикл
		
		Если стр.ТипСтроки <= 1 Тогда // разделы.
			
			СтрокаСравнения = Неопределено;
			Если СтрокиДерева2 = Неопределено Тогда
				МассивСтрок = ПолноеДерево.Строки.НайтиСтроки(Новый Структура("Наименование1,Уровень1,Обработано1",стр.Наименование,стр.Уровень,Ложь),Истина)
			Иначе
				МассивСтрок = СтрокиДерева2.НайтиСтроки(Новый Структура("Наименование1,Уровень1,Обработано1",стр.Наименование,стр.Уровень,Ложь),Истина)
			КонецЕсли;
			
			Если МассивСтрок.Количество()>0 Тогда
				СтрокаСравнения = МассивСтрок[0];
			КонецЕсли;
			
			Если Не СтрокаСравнения = Неопределено Тогда
				СтрокаСравнения.Обработано1 = Истина;
				ОбластьРаздел = Макет.ПолучитьОбласть("ОбластьРаздел");
				ОбластьРаздел.Параметры.Заполнить(стр);
				ОбластьРаздел.Параметры.Заполнить(СтрокаСравнения);
				ШаблонСДанными.Вывести(ОбластьРаздел,Уровень);
				ВывестиУровень(РеквизитыСравнения,Макет,стр.Строки,СтрокаСравнения.Строки,ПолноеДерево,ТекстОтбора,Уровень+1);
				
				МассивСтрок = СтрокаСравнения.Строки.НайтиСтроки(Новый Структура("Обработано1",Ложь),Ложь);
				ВывестиНеОбработанные(Макет,МассивСтрок,Уровень+1,Ложь);
				
				МассивСтрок = ПолноеДерево.Строки.НайтиСтроки(Новый Структура("Уровень1,Обработано1",стр.Уровень+1,Ложь),Ложь);
				ВывестиНеОбработанные(Макет,МассивСтрок,Уровень,Ложь);
			Иначе
				ОбластьРаздел = Макет.ПолучитьОбласть("ОбластьРазделПусто");
				ОбластьРаздел.Параметры.Заполнить(стр);
				ШаблонСДанными.Вывести(ОбластьРаздел,Уровень);
				ВывестиУровень(РеквизитыСравнения,Макет,стр.Строки,Неопределено,ПолноеДерево,ТекстОтбора,Уровень+1,Истина);
			КонецЕсли;
			
		Иначе // позиции.
			
			Если Пусто Тогда // позиции не найденного раздела.
				
				Если стр.ТипСтроки = 2 Тогда
					ОбластьПозиция = Макет.ПолучитьОбласть("ОбластьПусто");
					ОбластьПозиция.Параметры.Заполнить(стр);
					ШаблонСДанными.Вывести(ОбластьПозиция,Уровень);
				Иначе
					ОбластьПозиция = Макет.ПолучитьОбласть("ОбластьПодчиненПусто");
					ОбластьПозиция.Параметры.Заполнить(стр);
					ШаблонСДанными.Вывести(ОбластьПозиция,Уровень+1);
				КонецЕсли;
				
			Иначе 
				
				ОрборРасценок = "";
				Выполнить(ТекстОтбора);
				ОрборРасценок.Вставить("ТипСтроки1",стр.ТипСтроки);
				ОрборРасценок.Вставить("Обработано1",Ложь);
				МассивСтрок = СтрокиДерева2.НайтиСтроки(ОрборРасценок,Ложь);

				СтрокаСравнения = Неопределено;
				Если МассивСтрок.Количество()>0 Тогда
					СтрокаСравнения = МассивСтрок[0];
					СтрокаСравнения.Обработано1 = Истина;
				КонецЕсли;

				Если СтрокаСравнения = Неопределено Тогда // не нашли позицию.
					
					Если стр.ТипСтроки = 2 Тогда
						ОбластьПозиция = Макет.ПолучитьОбласть("ОбластьПусто");
						ОбластьПозиция.Параметры.Заполнить(стр);
						ШаблонСДанными.Вывести(ОбластьПозиция,Уровень);
					Иначе
						ОбластьПозиция = Макет.ПолучитьОбласть("ОбластьПодчиненПусто");
						ОбластьПозиция.Параметры.Заполнить(стр);
						ШаблонСДанными.Вывести(ОбластьПозиция,Уровень+1);
					КонецЕсли;

				Иначе
					
					ЕстьРазличия = СверитьДанныеПозиций(стр,СтрокаСравнения,РеквизитыСравнения);
					Если стр.ТипСтроки = 2 Тогда
						ОбластьПозиция = ?(ЕстьРазличия,Макет.ПолучитьОбласть("ОбластьРазличия"),Макет.ПолучитьОбласть("ОбластьПозиция"));
						ОбластьПозиция.Параметры.Заполнить(стр);
						ОбластьПозиция.Параметры.Заполнить(СтрокаСравнения);
						Если СравнениеПоАкту Тогда
							ОбластьПозиция.Параметры.Кол1 = СтрокаСравнения.ОбъемПоАкту1; 	
						КонецЕсли;
						ШаблонСДанными.Вывести(ОбластьПозиция,Уровень);
					Иначе
						ОбластьПозиция = ?(ЕстьРазличия,Макет.ПолучитьОбласть("ОбластьПодчиненРазличия"),Макет.ПолучитьОбласть("ОбластьПодчинен"));
						ОбластьПозиция.Параметры.Заполнить(стр);
						ОбластьПозиция.Параметры.Заполнить(СтрокаСравнения);
						Если СравнениеПоАкту Тогда
							ОбластьПозиция.Параметры.Кол1 = СтрокаСравнения.ОбъемПоАкту1; 	
						КонецЕсли;
						ШаблонСДанными.Вывести(ОбластьПозиция,Уровень+1);
					КонецЕсли;
						
				КонецЕсли;

			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиНеОбработанные(Макет,МассивСтрок,Уровень,ИскатьПодчиненные = Истина)
	
	Для Каждого стр Из МассивСтрок Цикл
		
		Если стр.Обработано1 Тогда
			Продолжить;
		КонецЕсли;
		
		Если стр.ТипСтроки1 <= 1 Тогда // разделы.
			стр.Обработано1 = Истина;
			ОбластьРаздел = Макет.ПолучитьОбласть("ОбластьРазделПусто");
			ОбластьРаздел.Параметры.Заполнить(стр);
			ШаблонСДанными.Вывести(ОбластьРаздел,Уровень);
			
			МассивСтрокНовый = стр.Строки.НайтиСтроки(Новый Структура("Обработано1",Ложь),ИскатьПодчиненные);
			ВывестиНеОбработанные(Макет,МассивСтрокНовый,Уровень+1);
			
		Иначе // позиции.
			стр.Обработано1 = Истина;
			Если стр.ТипСтроки1 = 2 Тогда
				ОбластьПозиция = Макет.ПолучитьОбласть("ОбластьПусто");
				ОбластьПозиция.Параметры.Заполнить(стр);
				ШаблонСДанными.Вывести(ОбластьПозиция,Уровень);
			Иначе
				ОбластьПозиция = Макет.ПолучитьОбласть("ОбластьПодчиненПусто");
				ОбластьПозиция.Параметры.Заполнить(стр);
				ШаблонСДанными.Вывести(ОбластьПозиция,Уровень+1);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СверитьДанныеПозиций(СтрокаЭталон,СтрокаСравнения,РеквизитыСравнения)
	
	ЕстьРазличия = Ложь;
	Для Каждого КлючИЗначение Из РеквизитыСравнения Цикл
		Если Не СтрокаЭталон[КлючИЗначение.Ключ] = СтрокаСравнения[КлючИЗначение.Значение] Тогда
			ЕстьРазличия = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЕстьРазличия;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьАктПоСмете()

	Объект.Акт = Документы.СМ_АктВыполненныхРабот.ПустаяСсылка();
	ТабАктов = СМ_СметаВызовСервера.ПолучитьАктыСметы(Объект.Смета1);
	Если ТабАктов.Количество() > 0 Тогда
		Для Каждого ТекСтрока Из ТабАктов Цикл
			Если НЕ ТекСтрока.Ссылка.ПометкаУдаления Тогда
				Объект.Акт = ТекСтрока.Ссылка;	
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиДанныеПоОС(РеквизитыСравнения,Макет,ТабДанных1,ТабДанных2,ТаблицаДанныхОС,ТипСтроительства)
	
	ПовторИтога 	= 0;
	ПовторИтога1 	= 0;
	НомПП			= 0;
	НомПП1			= 0;
	
	Для Каждого ТекСтрока Из ТаблицаДанныхОС Цикл
		
		ВсегоПоСтроке 	= 0;
		ВсегоПоСтроке1 	= 0;
		ВыводитьСтроку 	= Истина;
		ВыводитьСтроку1 = Истина;

		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Итог",ТекСтрока.Итог);

		СтруктураОтбора1 = Новый Структура;
		СтруктураОтбора1.Вставить("Итог",ТекСтрока.Итог);

		НайденнаяСтрока 	= ТабДанных1.Найти(ТекСтрока.Итог,"Итог");
		НайденнаяСтрока1 	= ТабДанных2.Найти(ТекСтрока.Итог,"Итог1");
		
		Если ЗначениеЗаполнено(НайденнаяСтрока) Тогда
			ВсегоПоСтроке = НайденнаяСтрока.СтроительныеРаботы + НайденнаяСтрока.МонтажныеРаботы + НайденнаяСтрока.Оборудование + НайденнаяСтрока.Прочие;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НайденнаяСтрока1) Тогда
			ВсегоПоСтроке1 = НайденнаяСтрока1.СтроительныеРаботы1 + НайденнаяСтрока1.МонтажныеРаботы1 + НайденнаяСтрока1.Оборудование1 + НайденнаяСтрока1.Прочие1;
		КонецЕсли;
		
		Если ТипЗнч(ТекСтрока.Итог) = Тип("СправочникСсылка.СМ_ИтогиПоГлавам") Тогда
			Если ТекСтрока.Итог.Накопительный Тогда
				Если ПовторИтога = ВсегоПоСтроке Тогда
					ВыводитьСтроку = Ложь;
				КонецЕсли;
			
				Если ПовторИтога1 = ВсегоПоСтроке1 Тогда
					ВыводитьСтроку1 = Ложь;
				КонецЕсли;
				
				ПовторИтога 	= ВсегоПоСтроке;
				ПовторИтога1 	= ВсегоПоСтроке1;
			Иначе
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НайденнаяСтрока) И ЗначениеЗаполнено(НайденнаяСтрока1) Тогда
			ЕстьРазличия = СверитьДанныеСмет(НайденнаяСтрока,НайденнаяСтрока1,РеквизитыСравнения);
			Если ЕстьРазличия Тогда
				ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаПустая");
			Иначе
				ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
			КонецЕсли;
		Иначе
			ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаПустая");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НайденнаяСтрока) И ВыводитьСтроку Тогда
			ОбластьСтрока.Параметры.Заполнить(НайденнаяСтрока);		
			ОбластьСтрока.Параметры.НаименованиеСметы	= НайденнаяСтрока.Итог.Наименование;
			ОбластьСтрока.Параметры.ВсегоПоСтроке 		= ВсегоПоСтроке;
			Если НайденнаяСтрока.ЭтоСмета Тогда
				НомПП 								= НомПП + 1;
				ОбластьСтрока.Параметры.НомерСметы 	= НайденнаяСтрока.Итог.НомерСметы;	 
				ОбластьСтрока.Параметры.НомерПП		= НомПП;
			ИначеЕсли ТипЗнч(НайденнаяСтрока.Итог) = Тип("СправочникСсылка.СМ_ИтогиПоГлавам") Тогда
				Если ТипСтроительства = Перечисления.СМ_ТипыСтроительства.КапитальныйРемонт Тогда
					ОбластьСтрока.Параметры.НаименованиеСметы = НайденнаяСтрока.Итог.НаименованиеРемонт;	
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НайденнаяСтрока1) И ВыводитьСтроку1 Тогда
			ОбластьСтрока.Параметры.Заполнить(НайденнаяСтрока1);		                                                                                        
			ОбластьСтрока.Параметры.НаименованиеСметы1 	= НайденнаяСтрока1.Итог1.Наименование;
			ОбластьСтрока.Параметры.ВсегоПоСтроке1 		= ВсегоПоСтроке1;
			Если НайденнаяСтрока1.ЭтоСмета1 Тогда
				НомПП1 								= НомПП1 + 1;
				ОбластьСтрока.Параметры.НомерСметы1	= НайденнаяСтрока1.Итог1.НомерСметы;	 
				ОбластьСтрока.Параметры.НомерПП1	= НомПП1;
			ИначеЕсли ТипЗнч(НайденнаяСтрока1.Итог1) = Тип("СправочникСсылка.СМ_ИтогиПоГлавам") Тогда
				Если ТипСтроительства = Перечисления.СМ_ТипыСтроительства.КапитальныйРемонт Тогда
					ОбластьСтрока.Параметры.НаименованиеСметы1 = НайденнаяСтрока1.Итог1.НаименованиеРемонт;	
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ВыводитьСтроку ИЛИ ВыводитьСтроку1 Тогда
			ШаблонСДанными.Вывести(ОбластьСтрока);
		КонецЕсли;
		
	КонецЦикла;	
		
КонецПроцедуры
	
&НаСервере
Процедура ВывестиДанныеПоСС(РеквизитыСравнения,Макет,ТабДанных1,ТабДанных2,ТаблицаДанныхСС,ТабГлавы,ТипСтроительства)
	
	ПовторИтога 	= 0;
	ПовторИтога1 	= 0;
	ПовторГлавы		= 0;	
	НомПП			= 0;
	НомПП1          = 0;
	
	ШаблонСДанными.НачатьАвтогруппировкуСтрок();
	
	Для Каждого СтрокаГлавы Из ТабГлавы Цикл
		
		НайденнаяГлава 	= ТабДанных1.Найти(СтрокаГлавы.Глава,"Глава");
		НайденнаяГлава1 = ТабДанных2.Найти(СтрокаГлавы.Глава,"Глава1");
		
		Если ЗначениеЗаполнено(НайденнаяГлава) И ЗначениеЗаполнено(НайденнаяГлава1) Тогда
			ОбластьГлава = Макет.ПолучитьОбласть("Глава");	
		Иначе
			ОбластьГлава = Макет.ПолучитьОбласть("ГлаваПустая");
		КонецЕсли;
		
		//ИтогПоГлаве = СМ_СметаПечатьОбъектнаяСводнаяВызовСервера.НайтиИтогПоГлаве(СтрокаГлавы.Глава,ТипСтроительства);
		
		Если ЗначениеЗаполнено(НайденнаяГлава) Тогда
			ОбластьГлава.Параметры.НаименованиеГлавы = СтрокаГлавы.Глава.Наименование;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НайденнаяГлава1) Тогда
			ОбластьГлава.Параметры.НаименованиеГлавы1 = СтрокаГлавы.Глава.Наименование;
		КонецЕсли;
		
		СтруктураОтбораГлав = Новый Структура;
		СтруктураОтбораГлав.Вставить("Глава",СтрокаГлавы.Глава);
		НайденныеСтрокиГлавы = ТаблицаДанныхСС.НайтиСтроки(СтруктураОтбораГлав);
		
		Если СтрокаГлавы.Всего <> ПовторГлавы Тогда
			ШаблонСДанными.Вывести(ОбластьГлава,1);
		КонецЕсли;
		
		Для Каждого ТекСтрока Из НайденныеСтрокиГлавы Цикл
			
			ВсегоПоСтроке 	= 0;
			ВсегоПоСтроке1 	= 0;
			ВыводитьСтроку 	= Истина;
			ВыводитьСтроку1 = Истина;

			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Итог",ТекСтрока.Итог);

			СтруктураОтбора1 = Новый Структура;
			СтруктураОтбора1.Вставить("Итог",ТекСтрока.Итог);

			НайденнаяСтрока 	= ТабДанных1.Найти(ТекСтрока.Итог,"Итог");
			НайденнаяСтрока1 	= ТабДанных2.Найти(ТекСтрока.Итог,"Итог1");
			
			Если ЗначениеЗаполнено(НайденнаяСтрока) Тогда
				ВсегоПоСтроке = НайденнаяСтрока.СтроительныеРаботы + НайденнаяСтрока.МонтажныеРаботы + НайденнаяСтрока.Оборудование + НайденнаяСтрока.Прочие;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(НайденнаяСтрока1) Тогда
				ВсегоПоСтроке1 = НайденнаяСтрока1.СтроительныеРаботы1 + НайденнаяСтрока1.МонтажныеРаботы1 + НайденнаяСтрока1.Оборудование1 + НайденнаяСтрока1.Прочие1;
			КонецЕсли;
			
			Если ТипЗнч(ТекСтрока.Итог) = Тип("СправочникСсылка.СМ_ИтогиПоГлавам") Тогда
				Если ТекСтрока.Итог.Накопительный Тогда
					Если ПовторИтога = ВсегоПоСтроке Тогда
						ВыводитьСтроку = Ложь;
					КонецЕсли;
				
					Если ПовторИтога1 = ВсегоПоСтроке1 Тогда
						ВыводитьСтроку1 = Ложь;
					КонецЕсли;
					
					ПовторИтога 	= ВсегоПоСтроке;
					ПовторИтога1 	= ВсегоПоСтроке1;
				Иначе
					Продолжить;
				КонецЕсли;
 			КонецЕсли;
			
			Если ЗначениеЗаполнено(НайденнаяСтрока) И ЗначениеЗаполнено(НайденнаяСтрока1) Тогда
				// Сравнение строк 
				ЕстьРазличия = СверитьДанныеСмет(НайденнаяСтрока,НайденнаяСтрока1,РеквизитыСравнения);
				Если ЕстьРазличия Тогда
					ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаПустая");
				Иначе
					ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
				КонецЕсли;
			Иначе
				ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаПустая");
			КонецЕсли;
		
			Если ЗначениеЗаполнено(НайденнаяСтрока) И ВыводитьСтроку Тогда
				ОбластьСтрока.Параметры.Заполнить(НайденнаяСтрока);		
				ОбластьСтрока.Параметры.НаименованиеСметы	= НайденнаяСтрока.Итог.Наименование;
				ОбластьСтрока.Параметры.ВсегоПоСтроке 		= ВсегоПоСтроке;
				Если НайденнаяСтрока.ЭтоСмета Тогда
					НомПП 								= НомПП + 1;
					ОбластьСтрока.Параметры.НомерСметы 	= НайденнаяСтрока.Итог.НомерСметы;	 
					ОбластьСтрока.Параметры.НомерПП		= НомПП;
				ИначеЕсли ТипЗнч(НайденнаяСтрока.Итог) = Тип("СправочникСсылка.СМ_ИтогиПоГлавам") Тогда
					Если ТипСтроительства = Перечисления.СМ_ТипыСтроительства.КапитальныйРемонт Тогда
						ОбластьСтрока.Параметры.НаименованиеСметы = НайденнаяСтрока.Итог.НаименованиеРемонт;	
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;
			
			Если ЗначениеЗаполнено(НайденнаяСтрока1) И ВыводитьСтроку1 Тогда
				ОбластьСтрока.Параметры.Заполнить(НайденнаяСтрока1);		                                                                                        
				ОбластьСтрока.Параметры.НаименованиеСметы1 	= НайденнаяСтрока1.Итог1.Наименование;
				ОбластьСтрока.Параметры.ВсегоПоСтроке1 	 	= ВсегоПоСтроке1;
				Если НайденнаяСтрока1.ЭтоСмета1 Тогда
					НомПП1 									= НомПП1 + 1;
					ОбластьСтрока.Параметры.НомерСметы1 	= НайденнаяСтрока1.Итог1.НомерСметы;	  
					ОбластьСтрока.Параметры.НомерПП1		= НомПП1;
				ИначеЕсли ТипЗнч(НайденнаяСтрока1.Итог1) = Тип("СправочникСсылка.СМ_ИтогиПоГлавам") Тогда
					Если ТипСтроительства = Перечисления.СМ_ТипыСтроительства.КапитальныйРемонт Тогда
						ОбластьСтрока.Параметры.НаименованиеСметы1 = НайденнаяСтрока1.Итог1.НаименованиеРемонт;	
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если ВыводитьСтроку ИЛИ ВыводитьСтроку1 Тогда
				ШаблонСДанными.Вывести(ОбластьСтрока,2);
			КонецЕсли;
			
		КонецЦикла;	
		
		ПовторГлавы = СтрокаГлавы.Всего;
		
	КонецЦикла;
	
	ШаблонСДанными.ЗакончитьАвтогруппировкуСтрок();
	
КонецПроцедуры

&НаСервере
Функция СобратьДанныеПоСмете(Ссылка)
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") Тогда
		ТекРегистр = "СМ_ИтогиПоГлавамОС";
	Иначе
		ТекРегистр = "СМ_ИтогиПоГлавамСС";
	КонецЕсли;	
	
	Если Ссылка.БазисныеЦены Тогда
		
		Запрос 			= Новый Запрос;
		Запрос.Текст 	= "
		|ВЫБРАТЬ
		|	ИтогиПоГлавам.Смета КАК ОбъектнаяСмета,
		|	ИтогиПоГлавам.Итог КАК Итог,
		|	ИтогиПоГлавам.Глава КАК Глава,
		|	СУММА(ЕСТЬNULL(
		|		ВЫБОР КОГДА ИтогиПоГлавам.ВидРабот = Значение(Перечисление.СМ_ВидыЗатратСмета.ОбщестроительныеРаботы) ИЛИ
		|			        ИтогиПоГлавам.ВидРабот = Значение(Перечисление.СМ_ВидыЗатратСмета.МеталломонтажныеРаботы) ИЛИ 
		|		 			ИтогиПоГлавам.ВидРабот = Значение(Перечисление.СМ_ВидыЗатратСмета.БуровзрывныеРаботы) ИЛИ 
		|		  			ИтогиПоГлавам.ВидРабот = Значение(Перечисление.СМ_ВидыЗатратСмета.СантехническиеРаботы) ИЛИ 
		|		  			ИтогиПоГлавам.ВидРабот = Значение(Перечисление.СМ_ВидыЗатратСмета.ГорнопроходческиеРаботы) ТОГДА
		|					ИтогиПоГлавам.ПрямЗатраты / 1000 ИНАЧЕ 0 КОНЕЦ,0)) КАК СтроительныеРаботы, 	  
		|	СУММА(ЕСТЬNULL(
		|		ВЫБОР КОГДА ИтогиПоГлавам.ВидРабот = Значение(Перечисление.СМ_ВидыЗатратСмета.МонтажныеРаботы) ТОГДА 
		|		ИтогиПоГлавам.ПрямЗатраты / 1000 ИНАЧЕ 0 КОНЕЦ,0)) КАК МонтажныеРаботы, 	  
		|	СУММА(ЕСТЬNULL(
		|		ВЫБОР КОГДА ИтогиПоГлавам.ВидРабот = Значение(Перечисление.СМ_ВидыЗатратСмета.Оборудование) ТОГДА 
		|		ИтогиПоГлавам.Оборуд / 1000 ИНАЧЕ 0 КОНЕЦ,0)) КАК Оборудование,  
		|	СУММА(ЕСТЬNULL(
		|		ВЫБОР КОГДА ИтогиПоГлавам.ВидРабот = Значение(Перечисление.СМ_ВидыЗатратСмета.ПрочиеРаботы) ТОГДА 
		|		ИтогиПоГлавам.ПрямЗатраты / 1000 ИНАЧЕ 0 КОНЕЦ,0)) КАК Прочие, 			
		|	СУММА(ЕСТЬNULL(ИтогиПоГлавам.ОснЗарплата / 1000,0) + ЕСТЬNULL(ИтогиПоГлавам.ЗарплМашин / 1000,0)) КАК ОплатаТруда,
		|		ЛОЖЬ КАК СтрокаОбработана
		|ИЗ
		|	РегистрСведений." + ТекРегистр + " КАК ИтогиПоГлавам
		|ГДЕ
		|	ИтогиПоГлавам.Смета = &Смета
		|СГРУППИРОВАТЬ ПО
		|	ИтогиПоГлавам.Смета,		
		|	ИтогиПоГлавам.Глава,
		|	ИтогиПоГлавам.Итог
		|УПОРЯДОЧИТЬ ПО
		|	ИтогиПоГлавам.Итог.ГлаваССРС.ПорядковыйНомер";	
	Иначе
		Запрос 			= Новый Запрос;
		Запрос.Текст 	= "
		|ВЫБРАТЬ
		|	ИтогиПоГлавам.Смета КАК ОбъектнаяСмета,
		|	ИтогиПоГлавам.Итог КАК Итог,
		|	ИтогиПоГлавам.Глава КАК Глава,
		|	СУММА(ЕСТЬNULL(
		|		ВЫБОР КОГДА ИтогиПоГлавам.ВидРабот = Значение(Перечисление.СМ_ВидыЗатратСмета.ОбщестроительныеРаботы) ИЛИ
		|			        ИтогиПоГлавам.ВидРабот = Значение(Перечисление.СМ_ВидыЗатратСмета.МеталломонтажныеРаботы) ИЛИ 
		|		 			ИтогиПоГлавам.ВидРабот = Значение(Перечисление.СМ_ВидыЗатратСмета.БуровзрывныеРаботы) ИЛИ 
		|		  			ИтогиПоГлавам.ВидРабот = Значение(Перечисление.СМ_ВидыЗатратСмета.СантехническиеРаботы) ИЛИ 
		|		  			ИтогиПоГлавам.ВидРабот = Значение(Перечисление.СМ_ВидыЗатратСмета.ГорнопроходческиеРаботы) ТОГДА
		|					ИтогиПоГлавам.ТекПрямЗатраты / 1000 ИНАЧЕ 0 КОНЕЦ,0)) КАК СтроительныеРаботы, 	  
		|	СУММА(ЕСТЬNULL(
		|		ВЫБОР КОГДА ИтогиПоГлавам.ВидРабот = Значение(Перечисление.СМ_ВидыЗатратСмета.МонтажныеРаботы) ТОГДА 
		|		ИтогиПоГлавам.ТекПрямЗатраты / 1000 ИНАЧЕ 0 КОНЕЦ,0)) КАК МонтажныеРаботы, 	  
		|	СУММА(ЕСТЬNULL(
		|		ВЫБОР КОГДА ИтогиПоГлавам.ВидРабот = Значение(Перечисление.СМ_ВидыЗатратСмета.Оборудование) ТОГДА 
		|		ИтогиПоГлавам.ТекОборуд / 1000 ИНАЧЕ 0 КОНЕЦ,0)) КАК Оборудование,  
		|	СУММА(ЕСТЬNULL(
		|		ВЫБОР КОГДА ИтогиПоГлавам.ВидРабот = Значение(Перечисление.СМ_ВидыЗатратСмета.ПрочиеРаботы) ТОГДА 
		|		ИтогиПоГлавам.ТекПрямЗатраты / 1000 ИНАЧЕ 0 КОНЕЦ,0)) КАК Прочие, 			
		|	СУММА(ЕСТЬNULL(ИтогиПоГлавам.ТекОснЗарплата / 1000,0) + ЕСТЬNULL(ИтогиПоГлавам.ТекЗарплМашин / 1000,0)) КАК ОплатаТруда, 	
		|		ЛОЖЬ КАК СтрокаОбработана
		|ИЗ
		|	РегистрСведений." + ТекРегистр + " КАК ИтогиПоГлавам
		|ГДЕ
		|	ИтогиПоГлавам.Смета = &Смета
		|СГРУППИРОВАТЬ ПО
		|	ИтогиПоГлавам.Смета,		
		|	ИтогиПоГлавам.Глава,
		|	ИтогиПоГлавам.Итог
		|УПОРЯДОЧИТЬ ПО
		|	ИтогиПоГлавам.Итог.ГлаваССРС.ПорядковыйНомер";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Смета",Ссылка);
	ТабРезультат = Запрос.Выполнить().Выгрузить();

	ТабРезультат.Колонки.Добавить("СортировкаИтогов",Новый ОписаниеТипов("Число"));
	ТабРезультат.Колонки.Добавить("ЭтоСмета", Новый ОписаниеТипов("Булево"));
	ТабРезультат.Колонки.Добавить("Порядковыйномер");
	ТабРезультат.Колонки.Добавить("НомерИтогаКЧему");
	
	Для Каждого СтрокаИтога Из ТабРезультат Цикл
		Если ТипЗнч(СтрокаИтога.Итог) = Тип("СправочникСсылка.СМ_ЛимитированныеЗатраты") Тогда
			СтрокаИтога.СортировкаИтогов 	= СтрокаИтога.Глава.ПорядковыйНомер * 10000 + 2000 + СтрокаИтога.Итог.НомерПоПорядку;
			СтрокаИтога.НомерИтогаКЧему		= СтрокаИтога.Итог.КИтогу.ПорядковыйНомер;
			СтрокаИтога.Порядковыйномер		= СтрокаИтога.Итог.КИтогу.ПорядковыйНомер;
		ИначеЕсли ТипЗнч(СтрокаИтога.Итог) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") ИЛИ ТипЗнч(СтрокаИтога.Итог) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") Тогда
			СтрокаИтога.СортировкаИтогов 	= СтрокаИтога.Глава.ПорядковыйНомер * 10000 + 1000 + СМ_СметаПечатьОбъектнаяСводнаяВызовСервера.НайтиНомерПоПорядкуСметы(Ссылка,СтрокаИтога.Итог);
			СтрокаИтога.ЭтоСмета			= Истина;
		ИначеЕсли ТипЗнч(СтрокаИтога.Итог) = Тип("СправочникСсылка.СМ_ИтогиПоГлавам") Тогда
			СтрокаИтога.СортировкаИтогов 	= СтрокаИтога.Глава.ПорядковыйНомер * 10000 + 3000 + СтрокаИтога.Итог.ПорядковыйНомер;
			СтрокаИтога.Порядковыйномер		= СтрокаИтога.Итог.ПорядковыйНомер;
		КонецЕсли;	
	КонецЦикла;	
	
	ТабРезультат.Сортировать("СортировкаИтогов");
	
	//СтрокаЛС.Параметры.НомерПП = НайтиНомерПоПорядкуСметы(Ссылка,СтрокаИтога.Итог);
	//СтрокаЛС.Параметры.НомерСметыДляПечати =  СтрокаИтога.Итог.НомерСметы;
	//ИтогПоГлаве = НайтиИтогПоГлаве(ПовторГлаваНеНакопительногоИтога,Ссылка.ТипСтроительства);

	Возврат ТабРезультат;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокРеквизитовСравнения()
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить("МонтажныеРаботы","МонтажныеРаботы1");
	Соответствие.Вставить("Оборудование","Оборудование1");
	Соответствие.Вставить("ОплатаТруда","ОплатаТруда1");
	Соответствие.Вставить("Прочие","Прочие1");
	Соответствие.Вставить("СтроительныеРаботы","СтроительныеРаботы1");
	
	Возврат Соответствие;
	
КонецФункции

&НаСервере
Функция ПолучитьОбщуюТаблицуДанныхОС(ДеревоСмета1,ДеревоСмета2);

	ТабИтогов = Новый ТаблицаЗначений;
	ТабИтогов.Колонки.Добавить("Итог");
	ТабИтогов.Колонки.Добавить("Глава");
	ТабИтогов.Колонки.Добавить("ПорядковыйНомер");
	ТабИтогов.Колонки.Добавить("НомерИтогаКЧему");

	Для Каждого ТекСтрока Из ДеревоСмета1 Цикл
		//Если ТипЗнч(ТекСтрока.Итог) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") ИЛИ 
		//	 ТипЗнч(ТекСтрока.Итог) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") Тогда
		//	Продолжить;	
		//КонецЕсли;
		НоваяСтрока 					= ТабИтогов.Добавить();
		НоваяСтрока.Итог	            = ТекСтрока.Итог;
		НоваяСтрока.Глава	            = ТекСтрока.Глава;
		НоваяСтрока.ПорядковыйНомер	  	= ТекСтрока.ПорядковыйНомер;
		НоваяСтрока.НомерИтогаКЧему		= ТекСтрока.НомерИтогаКЧему;
	КонецЦикла;
	
	Для Каждого ТекСтрока Из ДеревоСмета2 Цикл
		//Если ТипЗнч(ТекСтрока.Итог) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") ИЛИ 
		//	 ТипЗнч(ТекСтрока.Итог) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") Тогда
		//	Продолжить;	
		//КонецЕсли;
		НоваяСтрока 					= ТабИтогов.Добавить();
		НоваяСтрока.Итог	            = ТекСтрока.Итог;
		НоваяСтрока.Глава	            = ТекСтрока.Глава;
		НоваяСтрока.ПорядковыйНомер	  	= ТекСтрока.ПорядковыйНомер;
		НоваяСтрока.НомерИтогаКЧему		= ТекСтрока.НомерИтогаКЧему;
	КонецЦикла;
	
	ТабИтогов.Свернуть("Итог,Глава,ПорядковыйНомер,НомерИтогаКЧему");
	ТабИтогов.Сортировать("ПорядковыйНомер,НомерИтогаКЧему Убыв");

	Возврат ТабИтогов;
	
КонецФункции

&НаСервере
Функция ПолучитьОбщуюТаблицуДанныхСС(ДеревоСмета1,ДеревоСмета2);

	ТабИтогов = Новый ТаблицаЗначений;
	ТабИтогов.Колонки.Добавить("Итог");
	ТабИтогов.Колонки.Добавить("Глава");
	ТабИтогов.Колонки.Добавить("ПорядковыйНомер");
	ТабИтогов.Колонки.Добавить("НомерИтогаКЧему");

	ТабГлавы = Новый ТаблицаЗначений;
	ТабГлавы.Колонки.Добавить("Глава");
	ТабГлавы.Колонки.Добавить("Всего");

	Для Каждого ТекСтрока Из ДеревоСмета1 Цикл
		НоваяСтрокаГлавы				= ТабГлавы.Добавить();
		НоваяСтрокаГлавы.Глава			= ТекСтрока.Глава;
		НоваяСтрокаГлавы.Всего			= ТекСтрока.СтроительныеРаботы + ТекСтрока.МонтажныеРаботы + ТекСтрока.Оборудование + ТекСтрока.Прочие + ТекСтрока.ОплатаТруда;
										  
		НоваяСтрока 					= ТабИтогов.Добавить();
		НоваяСтрока.Итог	            = ТекСтрока.Итог;
		НоваяСтрока.Глава	            = ТекСтрока.Глава;
		НоваяСтрока.ПорядковыйНомер	  	= ТекСтрока.ПорядковыйНомер;
		НоваяСтрока.НомерИтогаКЧему		= ТекСтрока.НомерИтогаКЧему;
	КонецЦикла;
	
	Для Каждого ТекСтрока Из ДеревоСмета2 Цикл
		НоваяСтрокаГлавы				= ТабГлавы.Добавить();
		НоваяСтрокаГлавы.Глава			= ТекСтрока.Глава;
		НоваяСтрокаГлавы.Всего			= ТекСтрока.СтроительныеРаботы + ТекСтрока.МонтажныеРаботы + ТекСтрока.Оборудование + ТекСтрока.Прочие + ТекСтрока.ОплатаТруда;
										  
		НоваяСтрока 					= ТабИтогов.Добавить();
		НоваяСтрока.Итог	            = ТекСтрока.Итог;
		НоваяСтрока.Глава	            = ТекСтрока.Глава;
		НоваяСтрока.ПорядковыйНомер	  	= ТекСтрока.ПорядковыйНомер;
		НоваяСтрока.НомерИтогаКЧему		= ТекСтрока.НомерИтогаКЧему;
	КонецЦикла;
	
	ТабИтогов.Свернуть("Итог,Глава,ПорядковыйНомер,НомерИтогаКЧему");
	ТабИтогов.Сортировать("ПорядковыйНомер,НомерИтогаКЧему Убыв");
	
	ТабГлавы.Свернуть("Глава","Всего");
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ТабИтогов",ТабИтогов);
	СтруктураВозврата.Вставить("ТабГлавы",ТабГлавы);
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаСервере
Функция СверитьДанныеСмет(СтрокаЭталон,СтрокаСравнения,РеквизитыСравнения)
	
	ЕстьРазличия = Ложь;
	Для Каждого КлючИЗначение Из РеквизитыСравнения Цикл
		Если Не СтрокаЭталон[КлючИЗначение.Ключ] = СтрокаСравнения[КлючИЗначение.Значение] Тогда
			ЕстьРазличия = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЕстьРазличия;
	
КонецФункции

#КонецОбласти
